# BentFabricParamBendDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BentFabricParamBendDirection Property
ParameterTypeId Class See Also
---
"Bend Direction": Direction in which FabricSheet is bent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BentFabricParamBendDirection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BentFabricParamBendDirection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BentFabricParamBendDirection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace